Repository: BlessedSleepSeeker/blessedsleepseeker.com
Catalog: cgonline/cgonline/locale/*/LC_MESSAGES/django.po
Languages: fr

source: Return to
fr: Retour à

source: Prev
fr: Précédent

source: Click me !
fr: Cliquez Moi !

source: Next
fr: Suivant

source: Unveiled
fr: Dévoilé

source: Artwork
fr: Illustration

source: Source
fr: Fichiers Source

source: Learn more
fr: En apprendre plus

source: Back to the galery
fr: Retour à la galerie

source: Latest Artworks
fr: Dernieres Oeuvres

source: The Art Galery
fr: La Galerie D'Art

source: Latest Pieces
fr: Dernieres Oeuvres

source: Random
fr: Aléatoire

source: Return
fr: Retour

source: Topics
fr: Sujets

source: All blog entries tagged with
fr: Tout les articles avec le tag

source: The Digi-Feed
fr: Le Digi-Flux

source: All the news, directly into your brain !
fr: Toutes les nouvelles, directement dans votre cerveau !

source: Latest Projects
fr: Derniers Projets

source: By
fr: Par

source: All projects tagged with
fr: Tout les projets avec le tag

source: The Code Vault
fr: Le Coddre-Fort

source: Shouldn't a vault be closed ?
fr: Un coffre-fort ne devrait-il pas etre fermé ?

source: Release
fr: Exécutable

source: Do you need to centralise all of your Aseprite automation in one command ? I did, so I developed Asecript.
fr: Avez vous besoin de centraliser toute votre automatisation Aseprite en une seule commande ? Moi oui, alors j'ai développé Asecript

source: Asecript is a CLI script launcher. Launch Asecript and simply pick the script you want to use.
fr: Asecript est un lanceur de script depuis la ligne de commande. Lancez Ascript et choisissez votre script.

source: Available anywhere
fr: Disponible de partout

source: Add the script to your alias list and simply type 'Asecript' in your terminal to launch it.
fr: Ajoutez le script à votre liste d'alias et tapez 'Asecript' dans votre terminal pour le lancer.

source: Already usable
fr: Utilisable instantanément

source: Asecript come with 2 scripts already installed : BatchExport and BatchCommand. BatchExport will export every .ase/.aseprite file at a specified size in a folder & sub-folders. BatchCommand will call an Aseprite CLI command on every .ase/.aseprite file in the folder & subfolders.
fr: Asecript arrive avec 2 scripts déjà disponible : BatchExport & BatchCommand. BatchExport va exporter tout les fichiers .ase/.aseprite d'un dossier spécifique et de ses sous-dossiers. BatchCommand va appliquer une commande Aseprite sur tout les fichiers .ase/.aseprite d'un dossier spécifique et de ses sous-dossiers.

source: Easily Extensible
fr: Facilement Extensible

source: Add any scripts powershell or lua scripts in the ./script folder and use them instantly.
fr: Ajoutez n'importe quel script powershell ou lua dans le dossier ./script et utilisez instantanément.

source: Open and Free
fr: Ouvert et Gratuit

source: The Project is under the
fr: Le projet est sous la license

source: You can find the sources
fr: Vous pouvez trouver le code source

source: here
fr: içi

source: or download them
fr: ou les télécharger

source: here
fr: là

source: Building applications is fast with Django, what if setting up a project and a few useful tools was faster ?
fr: Construire des applications est déjà rapide avec Django, et si mettre un projet et quelques outils en place l'était encore plus ?

source: Setup a Django developement environnement in one command.
fr: Mettez en place un environnement de développment Django en une commande.

source: Setup an environnement
fr: Installez un environnement

source: DjangoProjectSetup will set up an django developpement environnement in a lightning quick fashion. Download the script then execute it, follow the instructions and voilà !
fr: DjangoProjectSetup va installer un environnement en 2 temps, 3 mouvements. Téléchargez et exécutez le script, suivez les instructions et voilà !

source: By default, DjangoProjectSetup create a python virtual environnement, install pre-commit and set up some hooks : `black, blacken-docs, flake8, trailing-whitespace, check-yaml, check-added-large-files`, install Django, get a gitignore for Django and generate the requirements.txt file.
fr: Par défaut, DjangoProjectSetup créé un environnement virtuel python, installe pre-commit et rajoute quelques hooks : black, blacken-docs, flake8, trailing-whitespace, check-yaml et check-added-large-files. Il va ensuite installer Django, récupérer un gitignore spécifique à Django et générer un fichier requirements.txt.

source: Extend or modify the script as you want, open source babyyyyyyyyy.
fr: Etendez ou modifiez le script comme vous le souhaitez. Open Source babyyyyyyy.

source: Global Game Jam Website
fr: Site de la Global Game Jam

source: Our submission for the 2023 Global Game Jam
fr: Notre soumission pour la Global Game Jam 2023

source: Made in 48h between Feb. 4 and Feb. 6 2023 with both Tong and Adrien Keller, 2 absolutely beautiful persons
fr: Créer en 48h entre le 4 et 6 février 2023, avec l'aide de Tong et Adrien Keller, 2 personnes très très stylées.

source: Using Godot and Aseprite, we produced a demo of an untitled Infiltration/Puzzle Roguelike. Not much more to say here, I wouldn't recommend trying it LOL.
fr: Avec l'aide de Godot et Aseprite, nous avons produit une démo d'un roguelike d'infiltration & de puzzle.

source: It was really fun spending a full weekend together working on the same project tho. Doing gamejams is a blast and I encourage you to try once if you never done one !
fr: C'était super fun de passer un weekend entier ensemble à travailler sur le meme projet. Les gamejams sont toujours un super moment et je vous encourage à y participer si vous n'en avez jamais faites !

source: What if you could shine, but in MINECRAFT ????
fr: Et si vous pouviez shine, mais dans MINECRAFT ????

source: Craft your shine, then proceed to schmoove on every single monster or player in the world !
fr: Construisez votre shine, et schmoovez sur l'entiereté des monstres et joueurs dans le monde !

source: Finished in 3 days...
fr: Fait en 3 jours...

source: ...but not because I was jamming or something, I was just done in 3 days.
fr: ...mais pas parce qu'il y avait une limite de temps, j'ai juste fini le projet en 3 jours et suis passé à autre chose.

source: Built with Fabric
fr: Construit avec Fabric

source: is an alternative to Forge Mod Loader. We like alternatives and IMO Forge kinda suck. Not having to do much to update your mods to different versions of MC help a lot.
fr: est une alternative au mod loader Forge. J'aime les alternatives et selon moi, Forge c'est un peu pas ouf quand meme. Le fait de ne pas avoir grand chose à faire pour faire passer son mod d'une version à une autre de Minecraft fait gagner beaucoup de points à Fabric.

source: Get some predictions from a REAL oracle. Luckily for all the gourmands here, the predictions come in the form of Fortune Cookies !
fr: Faites vous diviner votre futur par un REEL oracle ! Coup de pot pour tout les gourmands, les prédictions viennent sous la forme de cookie de la Fortune !

source: 100%% Useless
fr: 100%% Inutile

source: The oracle and the fortune cookies are simply here for flair. No real mechanics except eating your fortune cookie !
fr: Il n'y a aucune autre mécaniques que le RP que vous en ferez (il y a quand meme de quoi récupérer et manger le cookie, pas d'inquiétude).

source: A Jam Project
fr: Un Projet de Jam

source: This mod is the result of Creajam (rip), a weekly arty jam we used to run.
fr: Ce mod est le résultat de la Créajam (rip), une Jam artistique hebdomadaire dont nous étions les organisateurs.

source: My GMTK 2023 Submission, now expanded.
fr: Ma soumission pour la gamejam GMTK 2023, rénovée et étendue.

source: A game about funding quests (damn) and expeditions so adventurers can grab some loot for you.
fr: Un jeu où l'on finance et lance des expéditions d'aventurier, qui vont vous ramener ce qu'ils trouvent.

source: Head to
fr: Rendez vous sur

source: and download the game ! It's the final gamejam version, so it's the first 3 days of developement only.
fr: et Téléchargez le jeu ! C'est le rendu de gamejam, il n'y a donc que les 3 premiers jours de développement intégré à cette version.

source: A Work in Progress
fr: Un Projet en Cours

source: I have continued working on the project for a few days afterward (and then burned out, who could have seen this comming) and will start again in the future ! Expect updates !
fr: J'ai continué à travaillé sur Quest Giver après la jam (et ai fini par burnout, qui aurait bien pu voir ça venir ??), et recommencerais dans le futur. Restez à l'affut de nouvelles !

source: Built with Godot 4
fr: Développé avec Godot 4

source: is a free, open-source, no-string attached game engine. It has been my goto engine since 2020 and is well deserving of some support. The 4.0 being released in March 2023, I decided to learn it with this project.
fr: est un game engine gratuit, open source et sans royalties. C'est mon outil de choix depuis 2020 et mérite amplement des félicitations. La version 4.0 étant sortie en Mars 2023, j'en ai profité pour l'apprendre avec ce projet.

source: Ever wondered if AI could beat humans at street fighter ? We did.
fr: Vous vous êtes déjà demandé si les IA pouvaient battre les humains à Street Fighter ? Nous, oui.

source: Using OpenAI Gym Retro, Reinforcement Learning and a Convolution Network, we created Ryuforcement, an AI playing Street Fighter : Special Champion Edition on Genesis.
fr: En mélangeant OpenAI Gym Retro, de l'apprentissage par renforcement et un réseau de convolution, nous avons cuisiné Ryuforcement, une IA capable de jouer à Street Fighter : Special Champion Edition sur Genesis.

source: In the end, Ryuforcement started to block some attacks reliably ! We unfortunately had to end the project early due to Gym Retro not being a great environnement for fighting game AI training.
fr: A la fin de notre expérience, Ryuforcement commençait à bloquer certaines attaques avec constance ! Nous avons malheureusement dû mettre fin à au projet de manière prématuré, Gym Retro ne nous permettant pas d'atteindre nos objectifs.

source: Our readme on Github has a lot of info and goes in depth, be sure to check it out.
fr: Le readme sur Github a beaucoup plus d'infos et va plus en profondeur sur les sujets techniques, allez y jeter un oeil !

source: I did this project with Pierre-Eloy Sylvestre, a trully wonderful person
fr: J'ai fait ce projet avec Pierre-Eloy Sylvestre, une personne extraordinaire

source: A card creation tool for Wakfu TCG
fr: Un outil de création de carte pour Wakfu TCG

source: Create the card of your dream
fr: Créez la carte de vos rêves

source: Doing fan card is the dream of every single TCG player. Now, you can even do it on a game that was dead long before I even started the project ! Woohoo !
fr: Créer ses propres cartes est le rêve de tout les joueurs de TCG. Maintenant, vous pouvez même le faire sur un jeu qui était mort bien avant que je commence ce projet ! Youpi !

source: My First Project
fr: Mon Premier Projet

source: Built with Unity
fr: Développé sous Unity

source: Not Open but Free
fr: Fermé mais Gratuit

source: I'm sorry, I lost the sources. I am not kiding, this project is almost 7 years old now.
fr: Mes excuses, j'ai perdu les fichiers sources. C'est pas une blague, le projet à bientôt 7 ans maintenant, je ne sais pas où elles sont.

source: All projects tagged with
fr: Tout les projets avec le tag

source: The Workshop
fr: L'Atelier

source: Tinker, Tinker Little Star
fr: Il Soude Il Soude, le Furet

source: Basketball Holding Shelf
fr: Le support à ballons

source: How can I have my basketball on a shelf without it falling every 30 seconds ?
fr: Comment avoir mon ballon de basket sur une étagère sans qu'elle ne roule de partout ?

source: I love my basketball. It's a really cool object. It's round and has a nice texture to the touch and is just nice as decoration (imo). But it is TOO ROUND and it's rolling everywhere. We need to fix this.
fr: J'aime ma balle de basket, c'est un bel objet. C'est tout rond, a une texture agréable au touché et est bien beau en décoration. Mais c'est TROP ROND et ça roule de partout. Nous devons remédier à ce problème.

source: Here is a few step of the building process of the basketball-holder. Sorry for the photo quality, I used my smartphone and it's kinda old.
fr: Voilà quelques une des étapes de constructions du support à balles. Veuillez m'excuser pour la qualité des photos, j'ai utilisé mon téléphone portable et il accuse son âge.

source: For this project, I enlisted the help of my Grampa (again, yes), a professional woodworker, whom I thank wholeheartedly for his help and support in my varied endeavors
fr: Pour ce projet, j'ai recruté mon grand-père (une fois de plus, oui), un ancien ébéniste professionel. Je le remercie de tout mon coeur pour son aide et son support dans mes projets divers et variés

source: Planning out the Hole
fr: Préparer le Trou

source: Compass Time ! It's making a small groove, and I add some pencil into it to clearly see the circle.
fr: J'utilise le compas pour faire une rainure, et je repasse un coup de crayon papier pour bien voir où elle se trouve.

source: Before the Hole
fr: Avant le Trou

source: A small hole has been made. The jigsaw is going to follow the path soon...
fr: Un petit trou a été fait. La scie sauteuse va suivre le chemin tracé auparavant dans pas longtemps...

source: Training Arc !
fr: L'Arc narratif de l'entrainement !

source: I've practiced making a curve with the jigsaw before doing the full work. It was a really good idea.
fr: Je me suis entrainé à suivre les courbes avec la scie sauteuse avant de m'atteler au gros morceau. C'était une excellente idée.

source: The Hole is before us !
fr: Le Trou est révélé !

source: The hole has been made, and the second part can now start.
fr: Le trou est fait, et nous passons à la seconde partie : les finitions.

source: Sanding...
fr: Polissage...

source: Cleaning out the wood burr.
fr: On retire les petites échardes qui dépassent.

source: and Chamfering !
fr: Et chanfreinage !

source: The chamfer will stabilise the ball a lot more
fr: Le chanfrein va aider à stabiliser la balle et lui donner plus d'appui

source: The Finished Product
fr: Le Produit Fini

source: I didn't take any pictures but we glued 2 planks under to server as feets. Same as the stands, I've applied 2 coats of parquets varnish, giving a slightly darker color and a small protection against liquids.
fr: Je n'ai pas pris de photos mais nous avons collé 2 planches en dessous qui servent de pieds. Pareil que pour les supports à écran, j'ai appliqué 2 couches de vernis à parquet, pour le rendre un peu plus sombre et le protéger contre le gras.

source: Screen Stands
fr: Les supports à écrans

source: Sometimes, your screen need to be a little bit higher.
fr: Parfois, votre écran a besoin d'être un petit plus haut. 12cm plus haut, précisément.

source: My screens weren't at a comfortable height on my desk, and I used to put some random box under to make them higher. As you can guess, this is UGLY AF and took way more space on my desk than it needed to. I decided to build some stands which would allow me to elevate my screens and let the cables go through.
fr: Mes écrans n'étaient pas à une hauteur confortable, et j'avais l'habitude de les sur-élever avec des boites pas super sexy et bien trop volumineuse. J'ai donc décidé de construire des supports aux dimensions des pieds des écrans, pour sur-élever et laisser passer les cables en dessous.

source: Here is a few step of the building process of theses stands. Sorry for the photo quality, I used my smartphone and it's kinda old.
fr: Voilà quelques photos des étapes de constructions. Désolé pour la quaité, j'ai utilisé mon téléphone et il est un poil vieux.

source: For this project, I enlisted the help of my Grampa, a professional woodworker, whom I thank wholeheartedly for his help and support in my varied endeavors
fr: Pour ce projet, j'ai recruté mon grand-père (une fois de plus, oui), un ancien ébéniste professionel. Je le remercie de tout mon coeur pour son aide et son support dans mes projets divers et variés

source: The First Step
fr: Le Premier Pas

source: It's not actually the first, we started from a full plank but I didn't get any pictures.
fr: Ce n'est pas réellement le premier, nous avons démarrer avec une grande planche mais je n'ai pas pris de photo durant la découpe.

source: Glue time
fr: L'heure de colle

source: No screws needed, everything is glued together. Screws would be overkill as we are not going to move them around a lot and the weight will be splitted evenly.
fr: Pas besoin de vis ou clous, tout est collé ! Les vis ne sont pas nécéssaire, les stands ne bougeront pas souvent et le poids sera réparti sur les pieds.

source: Waiting for the glue to dry.
fr: Patientons pendant que la colle seche.

source: A full day of rest !
fr: Un jour entier de repos !

source: Screen Stands, Assemble !
fr: Les supports dans toutes leur gloire

source: At this point, our project is nearly finished.
fr: A ce moment, le projet est presque fini

source: I've applied 2 coats of parquets varnish, giving a slightly darker color and a small protection against liquids. I've thought about putting a veil of some kind to hide where the cable are going at some point, but ultimately decided not to.
fr: J'ai mis 2 couches de vernis à parquet, donnant une couleur un peu plus sombre et une petite protection contre le gras et les liquides. J'ai hésiter à rajouter un voile pour cacher l'entrée des cables mais finalement j'ai choisis de ne pas le faire.

source: Contact Informations
fr: Informations de Contact

source: Frequently Asked Questions
fr: Questions Fréquentes

source: Friends
fr: Amis

source: Cool persons all around !
fr: Des personnes très cools !

source: Home
fr: Accueil

source: Hey, welcome ! I'm a Blessed Sleep Seeker
fr: Hey, salut ! Je suis un Chercheur de Sommeil Beni

source: Just call me
fr: Vous pouvez m'appeler

source: Just as a well-filled day brings blessed sleep, so a well-employed life brings a blessed death.
fr: Comme une journée bien remplie amène un sommeil béni, une vie bien employée amène une mort bénie.

source: Leonardo Da Vinci
fr: Léonard De Vinci

source: It cannot be found by seeking, but only seekers shall find it.
fr: On ne peux le trouver en cherchant, mais seuls ceux qui le cherche pourront le trouver.

source: Sufi Proverb
fr: Proverbe Sufi

source: In my endless quest for Blessed Sleep, I've started creating things. This website is both a reminder to myself of all I've accomplished and a way to share it to you. I hope you will enjoy your time here.
fr: Dans ma quête sans fin pour le Sommeil Béni, j'ai commencé à créer des choses. Ce blog est à la fois un moyen de me souvenir de ce que j'ai fait et une plateforme pour le partager avec vous. J'espère que cela vous plaira.

source: New here ?
fr: Nouveau par içi ?

source: A good starting point is to change the language and theme if you want. Go top right of the header ! You can now browse the galeries to see my works. Here's
fr: Un bon point de départ est de changer la langue et le thème du site si vous le souhaitez. Direction en haut à droite ! Vous pouvez désormais visiter les galeries. Voilà

source: the Art Galery
fr: la Galerie D'Art

source: the Code Vault
fr: le Coddre-Fort

source: and
fr: et

source: the Workshop
fr: l'Atelier

source: You can also use the header to navigate !
fr: Vous pouvez aussi utiliser la barre de navigation pour vous déplacer !

source: Want more ?
fr: Vous en voulez plus ?

source: Come and see my super secret (nope) specials
fr: Venez et admirez mes

source: projects
fr: Projets Spéciaux

source: If you've seen them already (good job !), you can read my
fr: Si vous les avez déjà vu (yay !), vous pouvez aller lire le

source: blog posts
fr: blog

source: Latest Blog Posts
fr: Derniers Projets

source: I spent like 3 hours working on an animated text in here, but scrapped it at the last moment.
fr: J'ai passé environ 3 heures à travailler sur un texte animé pour la page d'acceuil, mais l'ai retiré au dernier moment.

source: Who am I
fr: Qui suis-je

source: Did you know ? My favorite pokemon isn't Bidoof but Oshawott !
fr: Le saviez-vous ? Mon pokémon préféré n'est pas Bidoof mais Moustillon

source: RSS Fluxs yipee !
fr: Des fluxs RSS ! Youpi !

source: Stay up to date by following the
fr: Restez au courant de toutes mes activités en suivant le

source: Blog RSS Flux
fr: flux RSS du Blog

source: or pick just what you want !
fr: ou soyez plus spécifique !

source: Only the latest pieces !
fr: Les dernières oeuvres !

source: Only the lastest updated dev projects !
fr: Les projets de développement mis à jour le plus récement !

source: Only the latest updated DIY projects !
fr: Les projets DIY mis à jour le plus récement !

source: Don't know how to use RSS ? Once you'll get it setup, it will be like scrolling on Twitter or Instagram. Head
fr: Vous ne savez pas comment utiliser RSS ? Une fois mis en place, ce sera comme scroller Twitter ou Instagram. Pour plus d'information, cliquez

source: Did you know ? RSS stands for RamSeS 2. (me when I spread missinformation on the internet)
fr: Le saviez-vous ? RSS signifie RamSeS 2. (moi quand je met des fausses informations sur les internets.)

source: Specials Projects
fr: Projets Spéciaux

source: The Attic
fr: Le Grenier

source: Where should I store this ?
fr: Où pourrais-je bien ranger tout ça...

source: Sci-Bi - Specials Projects
fr: Sci-Bi - Projets Spéciaux

source: and
fr: et

source: are two pixel-art fonts inspired by Science Fiction and old-school digital typography
fr: sont 2 polices en art des pixels inspirée par la Science-Fiction et la typographie old-school des débuts de l'informatique

source: I recommend that you set a higher font size than 20 to have an enjoyable reading experience in your software of choice
fr: Je recommande que vous utilisiez une taille de police supérieure ou égale à 20 pour garantir une expérience de lecture agréable.

source: This is Sci-Bi Regular.
fr: C'est Sci-Bi Regular.

source: I've used it in a few game projects and am using it for taking notes regularly.
fr: Je l'ai parfois utilisé dans quelques projets de jeux et régulièrement pour prendre des notes.

source: This is Sci-Bi Glitched.
fr: C'est Sci-Bi Glitched.

source: This is a lot less readable than Regular but the flair might just be what you want !
fr: Glitched est beaucoup moins lisible mais les ajouts stylistiques pourraient bien être justement ce qu'il vous faut.

source: More examples
fr: Plus d'exemples

source: Licensing
fr: License

source: I still haven't found what you were looking for... Sorry !
fr: Je n'ai pas encore trouvé ce que vous cherchiez... Désolé !

source: Go Back
fr: Retour

source: Go Home
fr: Acceuil

source: Others
fr: Autres

source: About me
fr: A propos

source: This is where I would put my easter eggs, if I had some.
fr: C'est là où je mettrais mes easter eggs, si j'en avais.
